# loc [location]
- 데이터프레임의 행이나 열에 label 형태 로 접근한다

## 문법 (함수)
    - 데이터프레임.loc[행이름, 열이름]
    - 데이터프레임.loc[행이름]

In [3]:
import pandas as pd

## 데이터프레임 생성

In [4]:
## 수식 함수 

df = pd.DataFrame(
    [
        range(1,21,2),
        range(2,21,2),
        range(10,101,10)
    ],
    ['row1','row2','row3'],
    [f'co{i}' for i in range(1,11)]
)
df

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20
row3   10   20   30   40   50   60   70   80   90   100

### 행추출

- 문법 : 데이터프레임.loc[행이름]
- **슬라이싱은 데이터프레임이지만, loc는 Series이다

In [5]:
df.loc['row1']

co1      1
co2      3
co3      5
co4      7
co5      9
co6     11
co7     13
co8     15
co9     17
co10    19
Name: row1, dtype: int64

In [6]:
type(df.loc['row1'])

pandas.core.series.Series

#### 각 행추출

In [7]:
df.loc['row1'], df.loc['row3']

(co1      1
 co2      3
 co3      5
 co4      7
 co5      9
 co6     11
 co7     13
 co8     15
 co9     17
 co10    19
 Name: row1, dtype: int64,
 co1      10
 co2      20
 co3      30
 co4      40
 co5      50
 co6      60
 co7      70
 co8      80
 co9      90
 co10    100
 Name: row3, dtype: int64)

In [8]:
df.loc[['row1','row3']]

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row3   10   20   30   40   50   60   70   80   90   100

In [9]:
type(df.loc[['row1','row3']])

pandas.core.frame.DataFrame

In [10]:
df['row1':'row1']['row2':'row3']# 앙되용

Empty DataFrame
Columns: [co1, co2, co3, co4, co5, co6, co7, co8, co9, co10]
Index: []

In [11]:
df[:'row2']

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20

In [12]:
df.loc[['row1','row2']]

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20

### 열 추출

In [13]:
df.loc[['row1','row2','row3'],'co2']

row1     3
row2     4
row3    20
Name: co2, dtype: int64

In [14]:
df.loc[:, 'co2']

row1     3
row2     4
row3    20
Name: co2, dtype: int64

### 문제

In [22]:
df.loc[:,['co2','co6','co8']]

      co2  co6  co8
row1    3   11   15
row2    4   12   16
row3   20   60   80

In [23]:
df[:][['co2','co6','co8']]

      co2  co6  co8
row1    3   11   15
row2    4   12   16
row3   20   60   80

In [ ]:
#연속형은 슬라이싱을 하라

In [33]:
df.loc[:,'co2':'co8']

      co2  co3  co4  co5  co6  co7  co8
row1    3    5    7    9   11   13   15
row2    4    6    8   10   12   14   16

In [39]:
df.loc['row2',['co2','co4']]

co2    4
co4    8
Name: row2, dtype: int64

In [38]:
df[1:2][['co2','co4']]

      co2  co4
row2    4    8

In [40]:
#행 row1,2 열 co2,4
df[:2][['co2','co4']]

      co2  co4
row1    3    7
row2    4    8

In [46]:
df.loc['row1':'row2',['co2','co4']]

      co2  co4
row1    3    7
row2    4    8